Masmiseim36/nxpSDK/devices/MKE15Z7/MKE15Z7.xml
        <register>
          <name>SDID</name>
          <description>System Device Identification Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xF80</resetMask>
          <fields>
            <field>
              <name>PINID</name>
              <description>Pin identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIN64</name>
                  <description>64-pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN100</name>
                  <description>100-pin</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROJECTID</name>
              <description>Project ID</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REVID</name>
              <description>Device revision number</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RAMSIZE</name>
              <description>RAM size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE16KB</name>
                  <description>16 KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE32KB</name>
                  <description>32 KB</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SERIESID</name>
              <description>Kinetis Series ID</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SERIESID_2</name>
                  <description>Kinetis E+ series</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUBFAMID</name>
              <description>Kinetis E-series Sub-Family ID</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAMILYID</name>
              <description>Kinetis E-series Family ID</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KE1x</name>
                  <description>KE1x Family (Enhanced features)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG1</name>
          <description>Flash Configuration Register 1</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF00FFF</resetMask>
          <fields>
            <field>
              <name>FLASHDIS</name>
              <description>Flash Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_EN</name>
                  <description>Flash is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_DIS</name>
                  <description>Flash is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHDOZE</name>
              <description>Flash Doze</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_EN</name>
                  <description>Flash remains enabled during Doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_DIS</name>
                  <description>Flash is disabled for the duration of Doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEPART</name>
              <description>FlexNVM partition</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EEERAMSIZE</name>
              <description>EEE SRAM SIZE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EEERAMSIZE_3</name>
                  <description>2 KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_4</name>
                  <description>1 KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_5</name>
                  <description>512 Bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_6</name>
                  <description>256 Bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_7</name>
                  <description>128 Bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_8</name>
                  <description>64 Bytes</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_9</name>
                  <description>32 Bytes</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFSIZE</name>
              <description>Program flash size</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE128K</name>
                  <description>128 KB of program flash memory, 4 KB protection region</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE256K</name>
                  <description>256 KB of program flash memory, 8 KB protection region</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVMSIZE</name>
              <description>FlexNVM size</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M0K</name>
                  <description>0 KB of FlexNVM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M32K</name>
                  <description>32 KB of FlexNVM</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG2</name>
          <description>Flash Configuration Register 2</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>MAXADDR1</name>
              <description>Max address block 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAXADDR0</name>
              <description>Max address block 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UIDH</name>
          <description>Unique Identification Register High</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UID127_96</name>
              <description>Unique Identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UIDMH</name>
          <description>Unique Identification Register Mid-High</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UID95_64</name>
              <description>Unique Identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UIDML</name>
          <description>Unique Identification Register Mid Low</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UID63_32</name>
              <description>Unique Identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UIDL</name>
          <description>Unique Identification Register Low</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UID31_0</name>
              <description>Unique Identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISCTRL</name>
          <description>Miscellaneous Control register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TRG</name>
              <description>Software Trigger bit to TRGMUX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_INT_SEL</name>
              <description>DMA channel interrupt OR select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0ODE</name>
              <description>UART0 Open Drain Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0ODE_0</name>
                  <description>Open drain is disabled on UART0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0ODE_1</name>
                  <description>Open drain is enabled on UART0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART1ODE</name>
              <description>UART1 Open Drain Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART1ODE_0</name>
                  <description>Open drain is disabled on UART1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1ODE_1</name>
                  <description>Open drain is enabled on UART1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART2ODE</name>
              <description>UART2 Open Drain Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART2ODE_0</name>
                  <description>Open drain is disabled on UART2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2ODE_1</name>
                  <description>Open drain is enabled on UART2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
