Masmiseim36/nxpSDK/devices/MKE15Z7/MKE15Z7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SMC</name>
      <description>System Mode Controller</description>
      <groupName>SMC</groupName>
      <prependToName>SMC_</prependToName>
      <baseAddress>0x4007E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VERID</name>
          <description>SMC Version ID Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FEATURE_0</name>
                  <description>Standard features implemented</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>SMC Parameter Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EHSRUN</name>
              <description>Existence of HSRUN feature</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EHSRUN_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EHSRUN_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELLS</name>
              <description>Existence of LLS feature</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELLS_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELLS_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELLS2</name>
              <description>Existence of LLS2 feature</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ELLS2_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELLS2_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVLLS0</name>
              <description>Existence of VLLS0 feature</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EVLLS0_0</name>
                  <description>The feature is not available.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVLLS0_1</name>
                  <description>The feature is available.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMPROT</name>
          <description>Power Mode Protection register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AVLP</name>
              <description>Allow Very-Low-Power Modes</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVLP_0</name>
                  <description>VLPR, VLPW, and VLPS are not allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVLP_1</name>
                  <description>VLPR, VLPW, and VLPS are allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCTRL</name>
          <description>Power Mode Control register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STOPM</name>
              <description>Stop Mode Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPM_0</name>
                  <description>Normal Stop (STOP)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPM_2</name>
                  <description>Very-Low-Power Stop (VLPS)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPM_6</name>
                  <description>Reseved</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPA</name>
              <description>Stop Aborted</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPA_0</name>
                  <description>The previous stop mode entry was successful.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPA_1</name>
                  <description>The previous stop mode entry was aborted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNM</name>
              <description>Run Mode Control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUNM_0</name>
                  <description>Normal Run mode (RUN)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNM_2</name>
                  <description>Very-Low-Power Run mode (VLPR)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STOPCTRL</name>
          <description>Stop Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSTOPO</name>
              <description>Partial Stop Option</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PSTOPO_0</name>
                  <description>STOP - Normal Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSTOPO_1</name>
                  <description>PSTOP1 - Partial Stop with both system and bus clocks disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSTOPO_2</name>
                  <description>PSTOP2 - Partial Stop with system clock disabled and bus clock enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMSTAT</name>
          <description>Power Mode Status register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PMSTAT</name>
              <description>Power Mode Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
